#include <iostream>
#include <clocale> // директивы

int main() {
    setlocale(LC_ALL, ".65001");   // подключаем кириллицу

    int n, m;

    // запрос ввода у пользователя
    std::cout << "Введите значение n: ";
    std::cin >> n;
    std::cout << "Введите значение m: ";
    std::cin >> m;

    // Копируем значения, чтобы каждое выражение работало с исходными n и m
    int n1 = n, m1 = m;
    int n2 = n, m2 = m;
    int n3 = n, m3 = m;

    // 1) ++n * ++m
    int res1 = ++n1 * ++m1;
    std::cout << "\n1) ++n * ++m = " << res1
              << " (после: n=" << n1 << ", m=" << m1 << ")\n";

    // 2) m++ < n
    bool res2 = (m2++ < n2);
    std::cout << "2) m++ < n = " << std::boolalpha << res2
              << " (после: m=" << m2 << ", n=" << n2 << ")\n";

    // 3) n++ > m
    bool res3 = (n3++ > m3);
    std::cout << "3) n++ > m = " << std::boolalpha << res3
              << " (после: n=" << n3 << ", m=" << m3 << ")\n";

    std::cout << "1. префиксный ++ меняет переменную до того, как её значение участвует в выражении." << "\n";
    std::cout << "2 и 3. постфиксный m++ в выражении использует старое значение, а увеличение происходит «после». bool показывает истинность выражений" << "\n";

    return 0;
}
